99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_mesh/esp32_mquickjs_wifi_mesh_sdk.c
static bool mesh_nonzero_address(const uint8_t *address)
{
    uint8_t any = 0;
    for (unsigned i = 0; i < 6; ++i) any |= address[i];
    return any != 0;
}

#include "esp32_mquickjs_wifi_mesh_scan.inc"
#include "esp32_mquickjs_wifi_mesh_controls.inc"

esp_err_t esp32_mquickjs_wifi_mesh_sdk_control(const esp32_mquickjs_wifi_mesh_token_t *token,
    esp32_mquickjs_wifi_mesh_control_t *control)
{
    if (!control || (unsigned)control->kind >= ESP32_MQUICKJS_MESH_CONTROL_COUNT)
        return ESP_ERR_INVALID_ARG;
    if (control->kind >= ESP32_MQUICKJS_MESH_CONFIGURATION) {
        esp_err_t checked = mesh_control_validate(control);
        if (checked) return checked;
    }
    bool table = control->kind <= ESP32_MQUICKJS_MESH_GROUP_DELETE;
    uint16_t limit = control->kind == ESP32_MQUICKJS_MESH_ROUTING_TABLE ?
        ESP32_MQUICKJS_MESH_MAX_NODES : ESP32_MQUICKJS_MESH_MAX_GROUPS;
    if (table && (!control->addresses || !control->capacity || control->capacity > limit))
        return ESP_ERR_INVALID_ARG;
    if (control->kind == ESP32_MQUICKJS_MESH_GROUP_ADD || control->kind == ESP32_MQUICKJS_MESH_GROUP_DELETE) {
        if (!control->count || control->count > control->capacity) return ESP_ERR_INVALID_ARG;
        for (unsigned i = 0; i < control->count; ++i) {
            if (!mesh_nonzero_address(control->addresses[i].addr)) return ESP_ERR_INVALID_ARG;
            for (unsigned j = 0; j < i; ++j)
                if (!memcmp(control->addresses[i].addr, control->addresses[j].addr, 6)) return ESP_ERR_INVALID_ARG;
        }
    }
    wifi_mesh_owner_t *owner = mesh_enter(token, true);
    if (!owner) return ESP_ERR_INVALID_STATE;
    esp_err_t error = mesh_scan_admit(owner, control->kind);
    if (error) {
        portENTER_CRITICAL(&s_mesh_lock); owner->status.busy = false; portEXIT_CRITICAL(&s_mesh_lock);
        return error;
    }
    switch (control->kind) {
    case ESP32_MQUICKJS_MESH_ROUTING_TABLE: {
        int count = 0;
        error = esp_mesh_get_routing_table(control->addresses, control->capacity * sizeof(mesh_addr_t), &count);
        if (!error && (count < 0 || count > control->capacity)) error = ESP_ERR_INVALID_RESPONSE;
        control->count = error ? 0 : count;
        break;
    }
    case ESP32_MQUICKJS_MESH_GROUP_LIST: {
        int count = esp_mesh_get_group_num();
        if (count < 0 || count > control->capacity) error = ESP_ERR_INVALID_SIZE;
        else if (count) error = esp_mesh_get_group_list(control->addresses, count);
        control->count = error ? 0 : count;
        break;
    }
    case ESP32_MQUICKJS_MESH_GROUP_ADD:
        error = esp_mesh_set_group_id(control->addresses, control->count); break;
    case ESP32_MQUICKJS_MESH_GROUP_DELETE:
        error = esp_mesh_delete_group_id(control->addresses, control->count); break;
    case ESP32_MQUICKJS_MESH_TODS_STATE:
        error = esp_mesh_is_root() ? esp_mesh_post_toDS_state(control->value) : ESP_ERR_INVALID_STATE; break;
    case ESP32_MQUICKJS_MESH_CONNECT:
        error = esp_mesh_connect(); break;
    case ESP32_MQUICKJS_MESH_DISCONNECT:
        error = esp_mesh_disconnect(); break;
    case ESP32_MQUICKJS_MESH_FLUSH_UPSTREAM:
        error = esp_mesh_flush_upstream_packets(); break;
    default:
        error = mesh_control_execute(owner, control); break;
    }
    portENTER_CRITICAL(&s_mesh_lock);
    owner->status.busy = false;
    if (control->kind > ESP32_MQUICKJS_MESH_GROUP_LIST) owner->status.native_snapshot_valid = false;
    portEXIT_CRITICAL(&s_mesh_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_mesh_sdk_send(const esp32_mquickjs_wifi_mesh_token_t *token,
    const esp32_mquickjs_wifi_mesh_send_t *send)
{
    if (!send || !send->bytes || !send->length || send->length > MESH_MPS ||
        (unsigned)send->destination > ESP32_MQUICKJS_MESH_BROADCAST ||
        (unsigned)send->protocol > MESH_PROTO_MQTT ||
        (send->destination == ESP32_MQUICKJS_MESH_TO_ROOT && !send->reliable) ||
        (send->drop_on_root_change && send->destination != ESP32_MQUICKJS_MESH_TO_DS)) return ESP_ERR_INVALID_ARG;
    if (send->destination == ESP32_MQUICKJS_MESH_TO_DS) {
        if (!send->address.mip.ip4.addr || !send->address.mip.port) return ESP_ERR_INVALID_ARG;
    } else if (send->destination != ESP32_MQUICKJS_MESH_TO_ROOT &&
               send->destination != ESP32_MQUICKJS_MESH_BROADCAST && !mesh_nonzero_address(send->address.addr))
        return ESP_ERR_INVALID_ARG;
    wifi_mesh_owner_t *owner = mesh_enter(token, true);
    if (!owner) return ESP_ERR_INVALID_STATE;
    mesh_addr_t destination = send->address;
    const mesh_addr_t *to = &destination;
    mesh_data_t data = {.data = (uint8_t *)send->bytes, .size = send->length,
        .proto = send->protocol, .tos = send->reliable ? MESH_TOS_P2P : MESH_TOS_DEF};
    int flags = MESH_DATA_P2P;
    mesh_opt_t option = {0}; int option_count = 0;
    esp_err_t error = ESP_OK;
    switch (send->destination) {
    case ESP32_MQUICKJS_MESH_TO_ROOT: to = NULL; flags = MESH_DATA_TODS; break;
    case ESP32_MQUICKJS_MESH_TO_DS: flags = MESH_DATA_TODS; break;
    case ESP32_MQUICKJS_MESH_FROM_DS:
        if (!esp_mesh_is_root()) error = ESP_ERR_INVALID_STATE;
        flags = MESH_DATA_FROMDS; break;
    case ESP32_MQUICKJS_MESH_TO_GROUP:
        option.type = MESH_OPT_SEND_GROUP; option.len = sizeof(destination); option.val = destination.addr;
        option_count = 1; break;
    case ESP32_MQUICKJS_MESH_BROADCAST: memset(destination.addr, 0xff, 6); break;
    default: break;
    }
    if (!send->reliable) flags |= MESH_DATA_NONBLOCK;
    if (send->drop_on_root_change) flags |= MESH_DATA_DROP;
    if (!error) error = esp_mesh_send(to, &data, flags, option_count ? &option : NULL, option_count);
    /* SDK copies into its own queue before returning. JS input must nevertheless
     * remain rooted/copied until this call returns, even if its Future ended. */
    portENTER_CRITICAL(&s_mesh_lock);
    if (!error) mesh_increment(&owner->status.sends);
    owner->status.busy = false;
    portEXIT_CRITICAL(&s_mesh_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_mesh_sdk_receive(const esp32_mquickjs_wifi_mesh_token_t *token, bool to_ds)
{
    wifi_mesh_owner_t *owner = mesh_enter(token, true);
    if (!owner) return ESP_ERR_INVALID_STATE;
    unsigned slot = to_ds ? 1 : 0;
    esp_err_t error = ESP_OK;
    portENTER_CRITICAL(&s_mesh_lock);
    bool pending = owner->messages[slot].sequence != 0;
    bool exhausted = !owner->next_sequence;
    uint32_t sequence = !pending && !exhausted ? owner->next_sequence++ : 0;
    portEXIT_CRITICAL(&s_mesh_lock);
    if (pending) goto done;
    if (exhausted) { error = ESP_ERR_NO_MEM; goto done; }
    if (to_ds && !esp_mesh_is_root()) { error = ESP_ERR_INVALID_STATE; goto done; }
    esp32_mquickjs_wifi_mesh_message_t message = {.to_ds = to_ds};
    mesh_data_t data = {.data = owner->receive_bytes + slot * MESH_MTU, .size = MESH_MTU};
    mesh_opt_t option = {.type = MESH_OPT_RECV_DS_ADDR, .len = sizeof(message.to), .val = message.to.addr};
    error = to_ds ? esp_mesh_recv_toDS(&message.from, &message.to, &data, 0, &message.flags, NULL, 0) :
        esp_mesh_recv(&message.from, &data, 0, &message.flags, &option, 1);
    if (error) goto done;
    if (data.size > MESH_MTU || data.data != owner->receive_bytes + slot * MESH_MTU) {
        error = ESP_ERR_INVALID_RESPONSE; goto done;
    }
    message.length = data.size; message.protocol = data.proto; message.service = data.tos;
    message.has_ds_address = to_ds || (option.type == MESH_OPT_RECV_DS_ADDR && option.len == sizeof(message.to) &&
        (message.flags & MESH_DATA_FROMDS));
    portENTER_CRITICAL(&s_mesh_lock);
    /* Reserve before the destructive SDK read: an event storm cannot consume
     * the last identity after the packet has already left its native queue. */
    if (!owner->status.closing) {
        message.sequence = sequence;
        owner->messages[slot] = message;
        mesh_increment(&owner->status.receives);
    } else error = ESP_ERR_INVALID_STATE;
    portEXIT_CRITICAL(&s_mesh_lock);
done:
    if (error) esp32_mquickjs_wireless_secure_zero(owner->receive_bytes + slot * MESH_MTU, MESH_MTU);
    portENTER_CRITICAL(&s_mesh_lock); owner->status.busy = false; portEXIT_CRITICAL(&s_mesh_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_mesh_sdk_message_copy(const esp32_mquickjs_wifi_mesh_token_t *token,
    bool to_ds, esp32_mquickjs_wifi_mesh_message_t *message, uint8_t *bytes, size_t capacity)
{
    if (!message || !bytes) return ESP_ERR_INVALID_ARG;
    unsigned slot = to_ds ? 1 : 0;
    portENTER_CRITICAL(&s_mesh_lock);
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (mesh_exact(token) && !s_mesh->status.closing) {
        const esp32_mquickjs_wifi_mesh_message_t *stored = &s_mesh->messages[slot];
        error = !stored->sequence ? ESP_ERR_NOT_FOUND : capacity < stored->length ? ESP_ERR_INVALID_SIZE : ESP_OK;
        if (!error) { *message = *stored; memcpy(bytes, s_mesh->receive_bytes + slot * MESH_MTU, stored->length); }
    }
    portEXIT_CRITICAL(&s_mesh_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_mesh_sdk_message_commit(const esp32_mquickjs_wifi_mesh_token_t *token,
    bool to_ds, uint32_t sequence)
{
    unsigned slot = to_ds ? 1 : 0;
    portENTER_CRITICAL(&s_mesh_lock);
    bool exact = sequence && mesh_exact(token) && !s_mesh->status.closing && s_mesh->messages[slot].sequence == sequence;
    if (exact) {
        esp32_mquickjs_wireless_secure_zero(s_mesh->receive_bytes + slot * MESH_MTU, s_mesh->messages[slot].length);
        memset(&s_mesh->messages[slot], 0, sizeof(s_mesh->messages[slot]));
    }
    portEXIT_CRITICAL(&s_mesh_lock);
    return exact ? ESP_OK : ESP_ERR_INVALID_STATE;
}

#include "esp32_mquickjs_wifi_mesh_events.inc"
#endif
